[{"title":"2017","date":"2017-12-27T08:05:09.000Z","path":"2017/12/27/2017/","text":"2017 January 穷游杭州 很幸运订到一家很漂亮的民宿，刷新了我对青年旅舍的理解 一起吃兰州拉面，玩桌游 三小时徒步西湖，雷锋塔顶看日落夕阳 深夜12点还在杭州的路上瞎逛，“和我在杭州的街头走一走，哦~~，直到所有的灯都熄灭了也不停留” Blog 1.0 March 鸡鸣寺看樱花，一个人逛玄武湖，带上耳机净化心灵 May iPhone 5 -&gt; iPhone 7 终于换手机啦，原来的iPhone 5屏幕实在是太小了，而且容量也不够大，换了 7 之后，异常流畅，不够据说Cook又给7的CPU降频了，打死也不更新系统了（更新了ios 11，有一次突然要我同意一份协议，然后莫名其妙升级了） Sister Married emmmmmm不能常见面了呢 最美好时光就是除夕夜一起放烟花了吧，今年放烟花恐怕只有我一人了 爸爸把姐姐搀上台的一刻感动哭了 June Manchester by the Sea 年度电影，一部很丧的电影，看完却很治愈 一个沉默的灵魂背后，永远不知道他背负了怎样的生死离别 July Driver‘s license 科目三考试遇上台风天气，我的车技是受过考验的 第一次4：30起床 August Teaching in Anhui 在霍邱支教，又体验了一下农村的生活，仿佛一下子回到2003年我刚上小学那会儿 十多天，每天六点起，十一点睡，吃相同的饭，做不同的事，能坚持下来，要谢谢一起支教的同学 September New semester 选了很多课，想做很多事，背负了更多的责任，可时间有限，觉得很累 October Mountain climbing 一起爬了东盘山 第二次4：30起床 山底下的生煎和紫菜汤真的很好吃！！ 富游南京 南京人生无限公司 其实我就是个地陪 坐在老门东的台阶上，一起“换脸” 来了南京之后，一直没去的夫子庙，商业气息很重，晚上的灯光景色也非常的商业化 在酒店里吃火锅，做饭（主要是煎蛋啦），玩大富翁玩到凌晨3点（我真的怕自己猝死） 最好的朋友就是可以一起大哭一起大笑吧，和你们在一起是我最放松最自我的状态 November Blog 2.0 在学习Vue 2.0 ，觉得教程的网页样式很好看，想做成博客，没想到真的有和我一样想法的人 When the wind blows 年度音乐，治愈系的声音 The Year 有的时候为别人考虑太多，反而伤害了自己 有的时候太犹豫不决，唯唯诺诺，错过了很多机会 有的时候想做，却没有几分钟热度 有的时候想做，又不敢做 注重体验生活的一年，去支教是我意料之外的事情 2018 攒钱买一台MacBook Pro 不想让爸妈出钱，我也是有房贷在身的人了 MBP的系统和屏幕 原来的电脑硬盘太小了 做一个自己的前端项目 一直没有去实现一个自己的idea ✈成都&amp;重庆 一个赛博风格的城市 更加敢想敢做，Be yourself","tags":[]},{"title":"Sakura","date":"2017-03-25T11:00:09.000Z","path":"2017/03/25/sakura/","text":"今天去看了樱花，一个人走在樱花路上，看见家长们带着调皮的孩子，看见一长串身着绿色校服的中学生来春游，互相笑着，调侃着，追赶奔跑着，仿佛曾经的自己 最近消化道不太舒服，有时候想多睡一会儿，就少了吃饭的时间，满足了第一个大脑，第二个“大脑”也会抗议的吧。对于远离父母的大学生来说，得病应该是最忌讳的事情了，没有父母的照料，饮食上无法选择，就像是刚出生的婴儿一样，毫无招架之力","tags":[]},{"title":"Hello Blog!","date":"2017-03-01T10:50:17.000Z","path":"2017/03/01/关于此博客/","text":"1.博客的诞生几天前在知乎上看见了一篇搭建博客的文章,寒假里也有搭建博客的想法，但是因为服务器和域名的门槛太高就搁置了，但是这篇文章中 hexo + github 的方法还是很简单的。 最重要的是可以自己设置界面，不像网易博客或者微博，有很大的自主权限。 2.项目中的技术github的使用，git版本控制和shell命令行模式的使用，HTML + CSS + JavaScript，SSH key，hexo框架，markdown。 2017.3.4 更新 markdown语法熟悉，老师要求需求等一系列文档用md格式 推荐编辑软件Typora 3.从项目中的收获因为有教程，一步一步来不会出太大差错。主要踩坑的地方就是_config.yml文件的配置。 1.图床。博客的头像以及文章中的图片都需要放置在云上，通过url获取，因为github空间有限制。 2.社交媒体的导航。也采用url的形式，例如weibo.com/username 3.打赏功能。收款的二维码图片在支付宝二维码平台获取 4.网站icon。favicon是网站的图标，应该放在source文件夹中。icon的大小为16 16或32 32。后缀名可以是ico或png，可以通过在线icon制作网站，如bitbug来转换。 5.github的使用。fork 别人的项目。 repository 代码仓库。pull request 提交代码请求","tags":[{"name":"前端","slug":"前端","permalink":"http://yoursite.com/tags/前端/"}]}]