[{"title":"Growth & Summer","date":"2017-06-20T14:46:44.000Z","path":"2017/06/20/2017-6-20/","text":"最近特别想买一个 Kindle 来读书， iPad 看书特别伤眼睛，而且到了大一下学期感觉自己天天对着电脑 不过钱是个问题，我发现我总是在考虑钱。。。什么时候才能赚钱呢？？ 马上一学期就要结束了，这一学期认识了很多朋友，也改变了自己很多 即将到来的暑假已经被社会实践和小学期填满了，要到 8. 20 才能回家 其实蛮期待这次支教活动的，虽然肯定很苦，但不知道为什么就是很想体验 前几天和妈妈打电话，妈妈说等着我回家和爸爸一起过生日。。。 可是我暑假也没有什么时间陪他们了，可能是我长大了吧 长大了，我们就离开了父母 之于暑假仅剩的片暇时光，想看村上春树的《海边的卡夫卡》，想和同学去上海，或许是迪斯尼？？ 我一直向往那种不紧不慢的生活，所有的事情都被井井有条的安排，但又会出现一些小意外，这就是我喜欢旅行的原因吧 继续住在慢生活区，在雨天的民宿里，坐在木凳木桌上，喝茶码代码哈哈","tags":[]},{"title":"手表","date":"2017-05-06T12:37:55.000Z","path":"2017/05/06/“手表”/","text":"种草帖 在知乎看到这款手表，立刻爱上了 带有圆角的指针盘层次鲜明 有点 Material Design 的感觉 是一个丹麦的品牌 价格￥1600 等我赚钱了再拔草吧","tags":[{"name":"好物","slug":"好物","permalink":"http://yoursite.com/tags/好物/"}]},{"title":"Sakura","date":"2017-03-25T11:00:09.000Z","path":"2017/03/25/sakura/","text":"今天去看了樱花，一个人走在樱花路上，看见家长们带着调皮的孩子，看见一长串身着绿色校服的中学生来春游，互相笑着，调侃着，追赶奔跑着，仿佛曾经的自己 最近消化道不太舒服，有时候想多睡一会儿，就少了吃饭的时间，满足了第一个大脑，第二个“大脑”也会抗议的吧。对于远离父母的大学生来说，得病应该是最忌讳的事情了，没有父母的照料，饮食上无法选择，就像是刚出生的婴儿一样，毫无招架之力","tags":[]},{"title":"英语知识点（一）","date":"2017-03-06T13:33:33.000Z","path":"2017/03/06/English-Learning-1/","text":"原文 Ride-hailing in China Uber gives app China’s Didi Chuxing and America’s Uber declare a truce in their ride-hailing war The Economist Aug 6th 2016 | SAN FRANCISCO and SHANGHAI WHAT will success look like in the extremely competitive Chinese ride-hailing market? “There are two versions,” Travis Kalanick, the chief executive and co-founder of Uber, recently told The Economist. “There is the gold medal, and there is the silver medal.” Over the past several years Uber, an American ride-hailing firm, has lost a fortune competing in China with Didi Chuxing, an inventive local rival, and its forerunners. Mr Kalanick seems to have decided that accepting a slice of gold with a side-dish of crow is better than continuing a bloody battle in hopes of getting silver or bronze. The brash Silicon Valley giant has done what seemed unthinkable just a few weeks ago: surrendered. On August 1st Uber agreed to hand over its Chinese operations to Didi, in return for a 17.7% stake in the combined company’s equity. Uber, though, will get only 5.9% of the voting rights in the new entity. Investors in Uber China, including Baidu, a big Chinese internet firm, will get a 2.3% stake. Mr Kalanick will serve on Didi’s board, and Cheng Wei, Didi’s boss, will join Uber’s board. The deal is a boon for both companies, but especially so for Uber. For years Uber has lagged behind Didi, which has an estimated four-fifths of the Chinese ride-hailing market (see chart). Critics of Uber’s record in China say the American firm was both late to the market and sometimes flat-footed as it tried to adapt. For too long it used Google maps, which do not work well in China, before switching to a local service. Another problem, not of its own making, was that it offered a credit-card-based payment system even though such cards are not widely used on the mainland. Many people prefer to transact using WeChat, a hugely popular messaging app. But WeChat (whose owner, Tencent, is an investor in Didi), sometimes blocked Uber from the superapp, wounding its business. In contrast, Didi proved a nimbler innovator than Uber and other rivals expected. It used its early presence in the market to establish its operating platform on a large scale, says Jeffrey Towson of Peking University. It started with taxi-hailing, not chauffeur-driven cars, which helped it win over grumpy taxi drivers and local politicians. In time, it added bus-hailing, car-pooling that came to resemble social networking and other inventive offerings. And it was able to integrate its service early on with WeChat. The two firms’ race was an extremely costly one: in two years, Uber lost $2 billion in China; Didi is believed to have lost far more. An investor close to both companies claims that Uber China lost $250m just in the past month, which he believes gave it no choice but to succumb. The money mainly went on subsidies to lure both drivers and passengers. Investors on both sides approve of the arrangement. But it was Uber’s investors who had been growing particularly queasy about the bloodbath in China. A long fight in China could have drained its resources and forced it to raise more money, diluting their stake. Uber, for its part, can console itself that the deal this week smooths the way for its expected initial public offering, which losses in China had reportedly held up. The stake in Didi should rise in value, and Uber can take a share of Chinese growth without having to spend another tuppence there. By striking the deal, Uber will have outdone Facebook, Google and Amazon in China, says Bill Gurley of Benchmark Capital, an investor in Uber who sits on its board. The deal raises three big questions. One is what the alliance means for the global ride-hailing market. When it was at war with Mr Kalanick, Didi had invested in Uber’s rivals, including Lyft in America, Ola in India and Grab in South-East Asia, in an attempt to weaken its enemy. The three smaller firms also formed an alliance to share technology and tips so as to better fight Uber. Now it is the alliance between Uber and Didi that seems strongest. The Chinese firm even agreed this week to invest $1 billion in the American startup. There are whispers that Didi and Uber are quickly moving forward with plans to carve up the world between them. As a result, Lyft, Ola and Grab may not be able to count on Didi’s cheque-book being open far into the future (although rumours surfaced this week that Didi is in fact involved in a new $600m round of financing for Grab and will continue with it). And the small fry now find themselves with a conflicted investor, who can try to influence their direction but has a strong, strategic relationship with their chief rival, Uber. Lyft and the others may try to find new backers to buy Didi’s stakes in them, but in the meantime it brings uncertainty to these firms. Speculation that predated this week’s news, that Lyft could be sold, has grown stronger still. Fare trade A second question is about the effect of the deal on ride-hailing customers. Consumers have been complaining noisily this week on Weibo, the Chinese version of Twitter, that fares have already shot up. An Uber driver in Shanghai says that pre-deal, he earned a subsidy at rush hour worth 1.8 times the fare. This will not last. And if a popular backlash grows from both consumers and drivers, it will focus attention on the Chinese government and its plans for the country’s ride-hailing market. Just before the news of the agreement between Uber and Didi, seven ministries jointly announced a new law that legalises online ride-hailing services for the first time—and, in effect, bans all subsidies. Some have claimed that the new law is a factor in why Uber China sold out. Because the underdog in ride-hailing markets typically needs subsidies more than the dominant firm, the new regime would have harmed it most had it stayed the course in China. But people familiar with the deal confirm that negotiations have in fact been under way for weeks, and say the new law was rather the final straw for the American firm. A last question is how the Chinese authorities will treat the deal. The Ministry of Commerce on August 2nd tartly rejected Didi’s claim that the deal was not subject to anti-trust scrutiny. Given public disgruntlement, it is likely to give the deal a noisy vetting. But the government has also allowed lots of big mergers and quasi-monopolies in various sectors of the internet already. It has a penchant for national champions, and Didi, after digesting its chief foe in China, will certainly be one. 1.词汇 ride-hailing 打车服务 truce 休战协定 forerunner 创始人 surrender 投降 brash 傲慢的 stake 赌注；股票 equity 普通股 boon 恩惠 board 董事会 lag behind 落后 flat-footed 无准备的 transact using WeChat 用微信支付 nimbler-nimble 更敏捷的 grumpy 性情乖戾的 succumb 被压垮 lure 诱惑 subsidy 补贴 tuppence 两便士；微不足道的东西 outdo 胜过 speculation 投机买卖 backlash 强烈抵制 foe/rival 竞争者 merger 并购 quasi-monopoly 准垄断 ​ 2.句子 Mr Kalanick seems to have decided that accepting a slice of gold with a side-dish of crow is better than continuing a bloody battle in hopes of getting silver or bronze. Kalanick 似乎已经决定了接受一小条金子和一只乌鸦的加菜比继续在这场血战中奋斗最后获得银牌或铜牌要好 ​","tags":[{"name":"英语学习","slug":"英语学习","permalink":"http://yoursite.com/tags/英语学习/"}]},{"title":"碎语|选择与价值","date":"2017-03-04T11:36:41.000Z","path":"2017/03/04/2/","text":"你做三四月的事，在八九月自会有答案 在豆瓣邂逅了余世存的《时间之书》，一本讲述二十四节气的书。 作者的本意大抵是在春天播种的农民伯伯在秋天就能迎来丰收。 其实很多事情也就像农活一样，我们在三四月份去做自己喜欢的事，自己认为对的事情，就像高考前的三四月，埋头题海，在八九月份你迈入大学校门的那一刻，就能听到世界给你的答案。 从前自己很患得患失，总是用有没有用来选择要不要做。在我高二那年的暑假，我本来拥有参加浙大数学夏令营的机会，在最后出发的那一刻却放弃了，因为我觉得这对我的高考没有用。有时候很难判断到底有没有用，也许现在没用，也许将来就会有用。 选择是一个具有时间局限性的东西. 年长的老人和年轻的小孩对一件事情做出两种截然不同的选择。老人稳重，小孩跳脱。其实各种各样的体验和经历塑造着人的阅历，当你回答一个你很陌生的问题时，当你面对一个复杂的处境时，更多的经历意味着更丰富的信息资源。人的学识会在不经意间从言谈举止中流露出来，会帮助你做出更好的决策。有时候成为关键要素的，就是你不经意间看过的一段话，走过的一段路。 所以尽管去体验，生活的千姿百态，世间的人情冷暖一一尝遍后，自会有答案。 但是另一方面，对于普通的一个家庭来说，有时候禁不住体验。有体验，就有成本。许多家庭本身并不富裕，他们的试错成本很高，不可能去让孩子到国外读书，去卖掉房子花掉积蓄来创业。这些风险无法承受，只能选择一条平平稳稳的道路。而那些敢于冒险，若是成功，则一举成名。若是失败，则一蹶不振。选择冒险还是平稳，这就是一场人生博弈。 人生不如意的时候，是上帝给的长假，这个时候就应该好好享受假期，当突然有一天假期结束，时来运转，人生才真正开始了。","tags":[{"name":"碎语","slug":"碎语","permalink":"http://yoursite.com/tags/碎语/"}]},{"title":"Hello Blog!","date":"2017-03-01T10:50:17.000Z","path":"2017/03/01/关于此博客/","text":"1.博客的诞生几天前在知乎上看见了一篇搭建博客的文章,寒假里也有搭建博客的想法，但是因为服务器和域名的门槛太高就搁置了，但是这篇文章中 hexo + github 的方法还是很简单的。 最重要的是可以自己设置界面，不像网易博客或者微博，有很大的自主权限，也很符合我对网站颜值的要求。 2.项目中的技术github的使用，git版本控制和shell命令行模式的使用，HTML + CSS + JavaScript，SSH key，hexo框架，markdown。 其中github的使用以及HTML + CSS + Javascript在寒假里已经大致学会了。git和shell命令，markdown以及SSH是什么还不是很清楚。 2017.3.4 更新 markdown语法基本熟悉 推荐在线编辑网址https://markable.in 编辑软件Typora 3.从项目中的收获因为有教程，一步一步来不会出太大差错。主要踩坑的地方就是_config.yml文件的配置。 1.图片的在线存储方式。博客的头像以及文章中的图片都需要放置在云上，通过url获取，因为github空间有限制，这种东西叫图床。现在我采用的是七牛云 2.社交媒体的导航。也采用url的形式，例如weibo.com/username 3.打赏功能。收款的二维码图片在支付宝二维码平台获取 4.网站icon。favicon是网站的图标，应该放在source文件夹中。icon的大小为16 16或32 32。后缀名可以是ico或png，可以通过在线icon制作网站，如bitbug来转换。 5.github的使用。fork 别人的项目。 repository 代码仓库。pull request 提交代码请求 4.博客的不足可以引入访问人数的统计，添加多说评论模块，百度分享，标签导航，文章目录，可以将代码托管到coding.net上加快访问速度。 2017.3.6 更新 引入多说评论模块","tags":[{"name":"前端","slug":"前端","permalink":"http://yoursite.com/tags/前端/"}]}]